Improve docs diagrams
